---
kind: method
id: M:Autodesk.Revit.DB.FilterStringLessOrEqual.#ctor
source: html/55107122-8ac9-3d61-9a3c-dc0b8cba74c0.htm
---
# Autodesk.Revit.DB.FilterStringLessOrEqual.#ctor Method

Constructs an instance of FilterStringLessOrEqual.

## Syntax (C#)
```csharp
public FilterStringLessOrEqual()
```